# Reshaping by Melt
The melt() function is useful to massage a DataFrame into a format where one or more columns are identifier variables, while all other columns, considered measured variables, are “unpivoted” to the row axis, leaving just two non-identifier columns, “variable” and “value”. The names of those columns can be customized by supplying the var_name and value_name parameters.

In [36]:
import pandas as pd
import numpy as np

cheese = pd.DataFrame({'first' : ['John', 'Mary','Peter'],
                       'last' : ['Doe', 'Smith','Lee'],
                       'height' : [5.5, 6.0,5.5],
                       'weight' : [130, 150, 160],
                       'distance': [9,10,11]
                      })

cheese

   distance  first  height   last  weight
0         9   John     5.5    Doe     130
1        10   Mary     6.0  Smith     150
2        11  Peter     5.5    Lee     160

In [41]:
pd.melt(cheese, id_vars=['first'])

    first  variable  value
0    John  distance      9
1    Mary  distance     10
2   Peter  distance     11
3    John    height    5.5
4    Mary    height      6
5   Peter    height    5.5
6    John      last    Doe
7    Mary      last  Smith
8   Peter      last    Lee
9    John    weight    130
10   Mary    weight    150
11  Peter    weight    160

In [37]:
pd.melt(cheese, id_vars=['first', 'last'])

   first   last  variable  value
0   John    Doe  distance    9.0
1   Mary  Smith  distance   10.0
2  Peter    Lee  distance   11.0
3   John    Doe    height    5.5
4   Mary  Smith    height    6.0
5  Peter    Lee    height    5.5
6   John    Doe    weight  130.0
7   Mary  Smith    weight  150.0
8  Peter    Lee    weight  160.0

In [38]:
pd.melt(cheese, 
        id_vars=['first', 'last'], 
        value_vars=['distance'])

   first   last  variable  value
0   John    Doe  distance      9
1   Mary  Smith  distance     10
2  Peter    Lee  distance     11

In [39]:
pd.melt(cheese, 
        id_vars=['first', 'last'], 
        var_name='quantity', # name change here
        value_vars=['distance'])

   first   last  quantity  value
0   John    Doe  distance      9
1   Mary  Smith  distance     10
2  Peter    Lee  distance     11

Column name has changed from `variable` to `quantity`

In [40]:
pd.melt(cheese, 
        id_vars=['first', 'last'], 
        var_name='quantity', 
        value_name='myValueName', # another name change here
        value_vars=['distance'])

   first   last  quantity  myValueName
0   John    Doe  distance            9
1   Mary  Smith  distance           10
2  Peter    Lee  distance           11

Column name has changed from `value` to `myValueName`